* Template
|----------------------------+-------+--------+-------+-----------|
| Configuration              | First | Second | Third | Average   |
|----------------------------+-------+--------+-------+-----------|
| Example with one train     |       |        |       | vmean([]) |
| Example with two trains    |       |        |       | vmean([]) |
| Shared Segment             |       |        |       | vmean([]) |
| Large Network              |       |        |       | vmean([]) |
| Station One                |       |        |       | vmean([]) |
| Station Two                |       |        |       | vmean([]) |
| Station Four               |       |        |       | vmean([]) |
| Station Six                |       |        |       | vmean([]) |
| Station Eight              |       |        |       | vmean([]) |
| Station Ten                |       |        |       | vmean([]) |
| Station Twelfth            |       |        |       | vmean([]) |
| Two trains same direction  |       |        |       | vmean([]) |
| Four trains same direction |       |        |       | vmean([]) |
| Nærumbanen (2T)            |       |        |       | vmean([]) |
|----------------------------+-------+--------+-------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No derailment (Move between connected segments)
** Elapsed time
#+PLOT: title:"Elapsed time (No derailment: Move between connected segments)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+-------------|
| Configuration              |    First |   Second |    Third |     Average |
|----------------------------+----------+----------+----------+-------------|
| Example with one train     |    0.004 |    0.004 |    0.004 |        4e-3 |
| Example with two trains    |    0.033 |    0.032 |    0.037 |       0.034 |
| Shared Segment             |    0.015 |    0.015 |    0.015 |       0.015 |
| Large Network              |    0.015 |    0.017 |    0.014 | 0.015333333 |
| Station One                |    0.010 |    0.012 |    0.023 |       0.015 |
| Station Two                |    0.119 |    0.118 |    0.139 |  0.12533333 |
| Station Four               |    2.570 |    2.138 |    2.411 |       2.373 |
| Station Six                |   48.013 |   47.405 |   47.224 |   47.547333 |
| Station Eight              |  298.282 |  296.721 |  295.815 |   296.93933 |
| Station Ten                | 1097.763 | 1042.993 | 1045.759 |   1062.1717 |
| Station Twelfth            | 3231.455 | 3163.849 | 3091.770 |    3162.358 |
| Two trains same direction  |    0.022 |    0.024 |    0.021 | 0.022333333 |
| Four trains same direction | 1537.286 | 1565.133 | 1525.910 |   1542.7763 |
| Nærumbanen (2T)            |   20.171 |   20.407 |   20.577 |      20.385 |
| Nærumbanen (3T)            |  407.498 |  410.378 |  404.128 |   407.33467 |
|----------------------------+----------+----------+----------+-------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
#+PLOT: title:"Memory Usage Peak (No derailment: Move between connected segments)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+-----------|
| Configuration              |    First |   Second |    Third |   Average |
|----------------------------+----------+----------+----------+-----------|
| Example with one train     |    7.612 |    7.632 |    7.640 |     7.628 |
| Example with two trains    |    8.558 |    8.604 |    8.620 |     8.594 |
| Shared Segment             |    9.792 |    9.836 |    9.796 |     9.808 |
| Large Network              |   12.008 |   12.072 |   12.000 | 12.026667 |
| Station One                |    8.540 |    8.556 |    8.572 |     8.556 |
| Station Two                |   12.608 |   12.672 |   12.684 | 12.654667 |
| Station Four               |   39.248 |   39.488 |   39.532 | 39.422667 |
| Station Six                |  119.492 |  120.340 |  120.344 | 120.05867 |
| Station Eight              |  274.880 |  276.720 |  276.768 | 276.12267 |
| Station Ten                |  560.252 |  565.828 |  565.840 | 563.97333 |
| Station Twelfth            | 1017.416 | 1264.912 | 1015.104 |  1099.144 |
| Two trains same direction  |   11.504 |   11.544 |   12.076 |    11.708 |
| Four trains same direction |  902.860 |  902.864 |  904.716 |    903.48 |
| Nærumbanen (2T)            |  118.712 |  119.532 |  119.740 |   119.328 |
| Nærumbanen (3T)            |  316.156 |  316.488 |  316.500 | 316.38133 |
|----------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No derailment (Critical section)
** Elapsed time
#+PLOT: title:"Elapsed time (No derailment: No trains in the critical section)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+--------------|
| Configuration              |    First |   Second |    Third |      Average |
|----------------------------+----------+----------+----------+--------------|
| Example with one train     |    0.002 |    0.002 |    0.003 | 2.3333333e-3 |
| Example with two trains    |    0.031 |    0.037 |    0.049 |        0.039 |
| Shared Segment             |    0.015 |    0.014 |    0.016 |        0.015 |
| Large Network              |    0.012 |    0.020 |    0.020 |  0.017333333 |
| Station One                |    0.022 |    0.020 |    0.026 |  0.022666667 |
| Station Two                |    0.116 |    0.145 |    0.138 |        0.133 |
| Station Four               |    2.125 |    2.202 |    2.114 |        2.147 |
| Station Six                |   47.666 |   47.449 |   47.622 |       47.579 |
| Station Eight              |  292.541 |  291.094 |  293.485 |    292.37333 |
| Station Ten                | 1073.923 | 1076.563 | 1074.403 |     1074.963 |
| Station Twelfth            | 3323.860 | 3224.331 | 3152.559 |    3233.5833 |
| Two trains same direction  |    0.012 |    0.023 |    0.026 |  0.020333333 |
| Four trains same direction | 1566.301 | 1570.500 | 1523.703 |    1553.5013 |
| Nærumbanen (2T)            |   19.936 |   19.731 |   19.947 |    19.871333 |
| Nærumbanen (3T)            |  416.936 |  415.357 |  415.144 |    415.81233 |
|----------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
#+PLOT: title:"Memory Usage Peak (No derailment: No trains in the critical section)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+-----------|
| Configuration              |    First |   Second |    Third |   Average |
|----------------------------+----------+----------+----------+-----------|
| Example with one train     |    7.580 |    7.592 |    7.592 |     7.588 |
| Example with two trains    |    8.540 |    8.564 |    8.572 | 8.5586667 |
| Shared Segment             |    9.744 |    9.776 |    9.784 |     9.768 |
| Large Network              |   11.968 |   12.020 |   12.032 | 12.006667 |
| Station One                |    8.496 |    8.524 |    8.528 |     8.516 |
| Station Two                |   12.552 |   12.600 |   12.620 | 12.590667 |
| Station Four               |   40.260 |   40.448 |   40.456 |    40.388 |
| Station Six                |  121.108 |  121.994 |  121.956 |   121.686 |
| Station Eight              |  274.252 |  276.084 |  276.132 | 275.48933 |
| Station Ten                |  560.432 |  563.852 |  563.852 |   562.712 |
| Station Twelfth            | 1011.640 | 1019.088 | 1019.096 |  1016.608 |
| Two trains same direction  |    9.764 |    9.796 |    9.804 |     9.788 |
| Four trains same direction |  905.036 |  905.036 |  905.472 | 905.18133 |
| Nærumbanen (2T)            |  115.860 |  116.676 |  116.884 | 116.47333 |
| Nærumbanen (3T)            |  311.716 |  312.044 |  312.044 | 311.93467 |
|----------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No collision
** Elapsed time
#+PLOT: title:"Elapsed time (No collision)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+-----------|
| Configuration              |   Second |    First |    Third |   Average |
|----------------------------+----------+----------+----------+-----------|
| Example with one train     |    0.004 |    0.004 |    0.004 |      4e-3 |
| Example with two trains    |    0.034 |    0.036 |    0.033 |    0.0345 |
| Shared Segment             |    0.015 |    0.014 |    0.015 |    0.0145 |
| Large Network              |    0.029 |    0.011 |    0.021 |     0.016 |
| Station One                |    0.019 |    0.022 |    0.022 |     0.022 |
| Station Two                |    0.142 |    0.102 |    0.136 |     0.119 |
| Station Four               |    2.399 |    2.094 |    2.331 |    2.2125 |
| Station Six                |   47.752 |   47.224 |   47.632 |    47.428 |
| Station Eight              |  271.339 |  290.211 |  269.255 |   279.733 |
| Station Ten                | 1072.370 | 1069.352 | 1051.182 |  1060.267 |
| Station Twelfth            | 3154.039 | 3032.947 | 3265.269 |  3149.108 |
| Two trains same direction  |    0.011 |    0.015 |    0.014 |    0.0145 |
| Four trains same direction | 1513.903 | 1519.292 | 1466.833 | 1493.0625 |
| Nærumbanen (2T)            |   20.008 |   19.764 |   19.959 |   19.8615 |
| Nærumbanen (3T)            |  395.981 |  393.703 |  393.868 |  393.7855 |
|----------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($3..$4)

** Memory Usage Peak
#+PLOT: title:"Memory Usage Peak (No collision)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+-----------|
| Configuration              |    First |   Second |    Third |   Average |
|----------------------------+----------+----------+----------+-----------|
| Example with one train     |    7.560 |    7.576 |    7.576 | 7.5706667 |
| Example with two trains    |    8.548 |    8.560 |    8.568 | 8.5586667 |
| Shared Segment             |    9.744 |    9.776 |    9.784 |     9.768 |
| Large Network              |   11.944 |   11.996 |   12.016 | 11.985333 |
| Station One                |    8.500 |    8.508 |    8.516 |     8.508 |
| Station Two                |   12.540 |   12.588 |   12.608 | 12.578667 |
| Station Four               |   39.228 |   39.448 |   39.476 |    39.384 |
| Station Six                |  122.276 |  123.040 |  123.044 | 122.78667 |
| Station Eight              |  276.256 |  277.364 |  277.368 |   276.996 |
| Station Ten                |  560.320 |  560.176 |  561.456 | 560.65067 |
| Station Twelfth            | 1266.208 | 1796.796 | 1019.336 |   1360.78 |
| Two trains same direction  |    9.744 |    9.780 |    9.792 |     9.772 |
| Four trains same direction |  903.736 |  903.792 |  904.192 | 903.90667 |
| Nærumbanen (2T)            |  112.928 |  113.756 |  113.976 | 113.55333 |
| Nærumbanen (3T)            |  313.656 |  313.988 |  314.000 | 313.88133 |
|----------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

* Will arrive
** Elapsed time
#+PLOT: title:"Elapsed time (Will arrive)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+-------------|
| Configuration              |    First |   Second |    Third |     Average |
|----------------------------+----------+----------+----------+-------------|
| Example with one train     |    0.003 |    0.004 |    0.002 |        3e-3 |
| Example with two trains    |    0.031 |    0.035 |    0.034 | 0.033333333 |
| Shared Segment             |    0.010 |    0.016 |    0.016 |       0.014 |
| Large Network              |    0.014 |    0.019 |    0.021 |       0.018 |
| Station One                |    0.018 |    0.019 |    0.021 | 0.019333333 |
| Station Two                |    0.109 |    0.114 |    0.136 |  0.11966667 |
| Station Four               |    2.189 |    2.502 |    2.125 |       2.272 |
| Station Six                |   46.999 |   46.819 |   47.045 |   46.954333 |
| Station Eight              |  296.215 |  296.269 |  295.207 |     295.897 |
| Station Ten                | 1060.366 | 1043.868 | 1053.478 |   1052.5707 |
| Station Twelfth            | 3291.267 | 3136.088 | 3102.526 |    3176.627 |
| Two trains same direction  |    0.013 |    0.012 |    0.019 | 0.014666667 |
| Four trains same direction | 1498.865 | 1498.277 | 1493.474 |    1496.872 |
| Nærumbanen (2T)            |   20.173 |   19.960 |   20.082 |   20.071667 |
| Nærumbanen (3T)            |  432.761 |  400.223 |  409.341 |   414.10833 |
|----------------------------+----------+----------+----------+-------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
#+PLOT: title:"Memory Usage Peak (Will arrive)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+-----------|
| Configuration              |    First |   Second |    Third |   Average |
|----------------------------+----------+----------+----------+-----------|
| Example with one train     |    7.500 |    7.500 |    7.500 |       7.5 |
| Example with two trains    |    8.472 |    8.472 |    8.476 | 8.4733333 |
| Shared Segment             |    9.668 |    9.688 |    9.692 | 9.6826667 |
| Large Network              |   11.900 |   11.924 |   11.924 |    11.916 |
| Station One                |    8.428 |    8.428 |    8.428 |     8.428 |
| Station Two                |   12.468 |   12.508 |   12.520 | 12.498667 |
| Station Four               |   39.064 |   39.228 |   39.260 |    39.184 |
| Station Six                |  119.216 |  119.604 |  119.612 | 119.47733 |
| Station Eight              |  272.788 |  273.536 |  273.548 | 273.29067 |
| Station Ten                |  715.344 |  716.436 |  559.096 | 663.62533 |
| Station Twelfth            | 1013.140 | 1020.800 | 1020.828 |  1018.256 |
| Two trains same direction  |    9.684 |    9.704 |    9.708 | 9.6986667 |
| Four trains same direction |  907.728 |  907.852 |  908.220 | 907.93333 |
| Nærumbanen (2T)            |  114.440 |  115.208 |  115.376 |   115.008 |
| Nærumbanen (3T)            |  312.232 |  312.752 |  312.764 | 312.58267 |
|----------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

